Leah730/STM32-PID-Control-System/Firmware/User/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
#include "OLED.h"
#include "LED.h"
#include "Timer.h"
#include "Key.h"
#include "RP.h"
#include "Motor.h"
#include "Encoder.h"
#include "Serial.h"
#include "AD.h"
#include "PID.h"

#define CENTER_ANGLE 2060
#define CENTER_RANGE 500
#define START_PWM 	35
#define START_TIME 100

uint8_t KeyNum;
uint8_t RunState;	//0为倒立摆程序停止，1为开始工作
uint16_t Angle;
int16_t Speed,Location;

PID_t AnglePID = {
	.Target = CENTER_ANGLE,
	
	.Kp = 0.3,
	.Ki = 0.01,
	.Kd = 0.4,
	
	.OutMax = 100,
	.OutMin = -100,
};

PID_t LocationPID = {
	.Target = 0,
	
	.Kp = 0.4,
	.Ki = 0,
	.Kd = 4,
	
	.OutMax = 100,
	.OutMin = -100,
};

int main(void)
{
	OLED_Init();
	Key_Init();
	LED_Init();
	RP_Init();
	Motor_Init();
	Encoder_Init();
	Serial_Init();
	AD_Init();
	
	Timer_Init();
	
	while (1)
	{
		KeyNum = Key_GetNum();
		if(KeyNum == 1)
		{
			if(RunState == 0)
			{
				//启动的时候，先摆一次，让摆杆离开盲区
				RunState = 21;
			}
			else{
				RunState = 0;
			}
		}
		if(KeyNum == 2)
		{
			LocationPID.Target += 408;
			if(LocationPID.Target > 4080)
			{
				LocationPID.Target = 4080;
			}
		}
		if(KeyNum == 3)
		{
			LocationPID.Target -= 408;
			if(LocationPID.Target < -4080)
			{
				LocationPID.Target = -4080;
			}
		}
		
		if(RunState)
		{
			LED_ON();
		}else{
			LED_OFF();
		}
		
//		AnglePID.Kp = RP_GetValue(1) / 4095.0 * 1;
//		AnglePID.Ki = RP_GetValue(2) / 4095.0 * 1;
//		AnglePID.Kd = RP_GetValue(3) / 4095.0 * 1;
		
//		LocationPID.Kp = RP_GetValue(1) / 4095.0 * 1;
//		LocationPID.Ki = RP_GetValue(2) / 4095.0 * 1;
//		LocationPID.Kd = RP_GetValue(3) / 4095.0 * 9;
		
		OLED_Printf(42,0,OLED_6X8,"%02d",RunState);
		
		OLED_Printf(0,0,OLED_6X8,"Angle");
		OLED_Printf(0,12,OLED_6X8,"Kp:%05.3f",AnglePID.Kp);
		OLED_Printf(0,20,OLED_6X8,"Ki:%05.3f",AnglePID.Ki);
		OLED_Printf(0,28,OLED_6X8,"Kd:%05.3f",AnglePID.Kd);
		OLED_Printf(0,40,OLED_6X8,"Tar:%04.0f",AnglePID.Target);
		OLED_Printf(0,48,OLED_6X8,"Act:%04d",Angle);
		OLED_Printf(0,56,OLED_6X8,"Out:%+04.0f",AnglePID.Out);
		
		OLED_Printf(64,0,OLED_6X8,"Location");
		OLED_Printf(64,12,OLED_6X8,"Kp:%05.3f",LocationPID.Kp);
		OLED_Printf(64,20,OLED_6X8,"Ki:%05.3f",LocationPID.Ki);
		OLED_Printf(64,28,OLED_6X8,"Kd:%05.3f",LocationPID.Kd);
		OLED_Printf(64,40,OLED_6X8,"Tar:%+05.0f",LocationPID.Target);
		OLED_Printf(64,48,OLED_6X8,"Act:%+05d",Location);
		OLED_Printf(64,56,OLED_6X8,"Out:%+04.0f",LocationPID.Out);
		
		OLED_Update();
	}
}

void TIM1_UP_IRQHandler(void)
{
	static uint16_t Count0,Count1,Count2,CountTime;
	static uint16_t Angle0,Angle1,Angle2;
	
	if (TIM_GetITStatus(TIM1, TIM_IT_Update) == SET)
	{
		Key_Tick();
		
		Angle = AD_GetValue();
		Speed = Encoder_Get();
		//也可以在Encoder_Get函数中直接返回TIM_GetCounter，因为计数器CNT的值，本身就是位置
		//Location += Encoder_Get();
		Location += Speed;
		
		if(RunState==0)
		{
			Motor_SetPWM(0);
		}else if(RunState==1)
		{
			Count0++;
			if(Count0>=40)
			{
				Count0=0;
				
				Angle2 = Angle1;
				Angle1 = Angle0;
				Angle0 = Angle;
				
				if(Angle0 > CENTER_ANGLE + CENTER_RANGE
					&& Angle1 > CENTER_ANGLE + CENTER_RANGE
					&& Angle2 > CENTER_ANGLE +CENTER_RANGE
				&& Angle1 < Angle0
				&& Angle1 < Angle2)
				{
					RunState = 21;
				}
				
				if(Angle0 < CENTER_ANGLE - CENTER_RANGE
					&& Angle1 < CENTER_ANGLE - CENTER_RANGE
					&& Angle2 < CENTER_ANGLE -CENTER_RANGE
				&& Angle1 > Angle0
				&& Angle1 > Angle2)
				{
					RunState = 31;
				}
				
				if(Angle0 > CENTER_ANGLE - CENTER_RANGE
					&& Angle0 < CENTER_ANGLE + CENTER_RANGE
					&& Angle1 > CENTER_ANGLE - CENTER_RANGE
					&& Angle1 < CENTER_ANGLE + CENTER_RANGE
					&& Angle2 > CENTER_ANGLE - CENTER_RANGE
					&& Angle2 < CENTER_ANGLE + CENTER_RANGE)
				{
					//规定起摆成功的位置就是0，避免急切回到0位置，摇晃不稳定
					Location = 0;
					//避免误差累积
					AnglePID.ErrorInt = 0;
					LocationPID.ErrorInt = 0;
					RunState = 4;
				}
			}	
		}else if(RunState==21)
		{
			Motor_SetPWM(START_PWM);
			CountTime = START_TIME;
			RunState = 22;
		}else if(RunState==22)
		{
			CountTime--;
			if(CountTime==0)
			{
				RunState = 23;
			}
		}else if(RunState==23)
		{
			Motor_SetPWM(-START_PWM);
			CountTime = START_TIME;
			RunState = 24;
		}else if(RunState==24)
		{
			CountTime--;
			if(CountTime==0)
			{
				Motor_SetPWM(0);
				RunState = 1;
			}
		}else if(RunState==31)
		{
			Motor_SetPWM(-START_PWM);
			CountTime = START_TIME;
			RunState = 32;
		}else if(RunState==32)
		{
			CountTime--;
			if(CountTime==0)
			{
				RunState = 33;
			}
		}else if(RunState==33)
		{
			Motor_SetPWM(START_PWM);
			CountTime = START_TIME;
			RunState = 34;
		}else if(RunState==34)
		{
			CountTime--;
			if(CountTime==0)
			{
				Motor_SetPWM(0);
				RunState = 1;
			}
		}else if(RunState==4)
		{
			if(!(Angle > CENTER_ANGLE - CENTER_RANGE
				&&Angle < CENTER_ANGLE + CENTER_RANGE))
			{
				RunState = 0;
			}
			
			Count1++;
			if(Count1 >= 5)
			{
				Count1 = 0;
				
				AnglePID.Actual = Angle;
				PID_Update(&AnglePID);
				Motor_SetPWM(AnglePID.Out);
			}
			Count2++;
			if(Count2 >= 50)
			{
				Count2 = 0;
				
				LocationPID.Actual = Location;
				PID_Update(&LocationPID);
				AnglePID.Target = CENTER_ANGLE - LocationPID.Out;
			}
		}
		
		TIM_ClearITPendingBit(TIM1, TIM_IT_Update);
	}
}